nxp-appcodehub/an-mc_pfc_56f83783/HVP_pmsm_pfc_MC56F83783/drivers/fsl_sim.h
/*
 * Copyright 2020 NXP
 * All rights reserved.
 *
 * SPDX-License-Identifier: BSD-3-Clause
 */

#ifndef _FSL_SIM_H_
#define _FSL_SIM_H_

#include "fsl_common.h"

/*!
 * @defgroup sim SIM: System Integration Module Driver
 * @details This document consists of sections titled with <b>Driver Overview</b>, <b>Data Structures</b>,
 *          <b>Enumerations</b>, <b>Functions</b>, etc., each with an overview list and detailed documentation.
 *          It is recommended to read the <b>Driver Overview</b> first for it includes a comprehensive description
 *          of the peripheral, driver and driver changes. Other sections give detailed information for APIs, enums,
 *          macros, etc., for your further reference.
 * @{
 */

/*******************************************************************************
 * ChangeLog
 ******************************************************************************/
/*!
 * @defgroup sim_driver_log The Driver Change Log
 * @ingroup sim
 * @{
 * The current SIM driver version is 2.0.0.
 *
 *     - 2.0.0
 *         - Initial version.
 * @}
 */

/*******************************************************************************
 * Introducation of peripheral and driver
 ******************************************************************************/
/*!
 * @defgroup sim_intro SIM Peripheral and Driver Overview
 * @ingroup sim
 * @brief Content including 1) peripheral features and work logic; 2) driver design logic
 * @{
 *
 *
 * Peripheral features and how this peripheral works
 * ==================================================
 * The System Integration Module interacts with a variety of other on-chip resources and provides multiple services.
 *
 *  Features
 *  ---------
 *  + Manages low power mode entry and exit.
 *  + Software on chip peripherals.
 *  + Controls inter-peripheral muxing and signal relationships.
 *  + Control voltage regulators.
 *  + Provides write protection for safety critical memory mapped registers.
 *  + Contains the information of chip's JTAG ID and suggested trim values set at the factory.
 *  + Supports short addressing control.
 *  + Internal Peripheral Extend Control Interfaces
 *
 * How this driver is designed to make this peripheral works.
 * ===========================================================
 *  The SIM interacts with a variety of other on-chip resources, based on the behaviour, this driver is diviced in
 *  several function groups.
 *  + Low Power Mode Control Related Interfaces \n
 *      The APIs in this function group can be used to enter/exit low power mode(including WAIT mode and STOP mode) and
 *      config low power mode operation mode.
 *  + Reset Related Interfaces \n
 *      The APIs in this function group can be used to software reset device and other internal module.
 *  + Peripheral Signal Muxing Control Interfaces \n
 *      The APIs in this function group can be used to set the mux of peripheral signal.
 *  + Voltage Regulators Control Interfaces \n
 *      The APIs in this function group can be used to control the low power mode on-chip regulators, including large
 *      voltage regulator and small voltage regulator.
 *  + Write Protection Interfaces \n
 *      The APIs in this function group can be used to set write protection of some peripherals' registers.
 *  + JTAG ID And Factory Trim Value Interfaces \n
 *      The APIs in this function group can be used to return JTAG ID, PMC bandgap trim value, and 200 khz ROSC
 *      frequency trim value.
 *  + Short Addressing Control Related Interfaces \n
 *      The APIs in this function group can be used to set short address location upper bits.
 *  + Software Control Interfaces \n
 *      The APIs in this function group can be used to set software control registers.
 *  + Internal Peripheral Extend Control Interfaces \n
 *      The APIs in this function group can be used to set other peripherals' extended features.
 *
 * @}
 */

/*******************************************************************************
 * Definitions
 ******************************************************************************/

/*! @name Driver version */
/*@{*/
/*! @brief SIM driver version. */
#define FSL_SIM_DRIVER_VERSION (MAKE_VERSION(2, 0, 0))
/*@}*/

/* Component ID definition, used by tools. */
#ifndef FSL_COMPONENT_ID
#define FSL_COMPONENT_ID "platform.drivers.dsc_sim"
#endif

/*! @brief The macro of REST status bit field mask.  */
#define SIM_RESET_STATUS_MASK                                                                        \
    (SIM_RSTAT_COP_WIN_MASK | SIM_RSTAT_SWR_MASK | SIM_RSTAT_COP_CPU_MASK | SIM_RSTAT_COP_LOR_MASK | \
     SIM_RSTAT_EXTR_MASK | SIM_RSTAT_POR_MASK)

/*!
 * @brief The definition of the short regulator control mode bit field mask.
 */
#define SIM_PWR_SR27_CONTROL_MODE_MASK (SIM_PWR_SR27STDBY_MASK | SIM_PWR_SR27PDN_MASK)
/*! @brief The definition of the short regulator control mode bit field shift. */
#define SIM_PWR_SR27_CONTROL_MODE_SHIFT (2U)
/*! @brief The macro that can be used to set the bit field of PWR register's short regulator bit field. */
#define SIM_PWR_SR27_CONTROL_MODE(x) \
    (((uint16_t)(((uint16_t)(x)) << SIM_PWR_SR27_CONTROL_MODE_SHIFT)) & SIM_PWR_SR27_CONTROL_MODE_MASK)

/*! @brief The definition of the PORT register bit filed mask. */
#define SIM_PROT_BIT_FIELD_MASK(moduleName) ((uint16_t)(3U << (moduleName)))
/*! @brief The macro that can be used to set module's protection mode. */
#define SIM_PORT_SET_MODE_PROTECTION_MODE(moduleName, protectionMode) \
    ((uint16_t)(((uint16_t)(protectionMode)) << (moduleName)))

/*!
 * @brief The enumeration of system reset status flags, such as power on reset, software reset, etc.
 */
enum _sim_reset_status_flags
{
    kSIM_PowerONResetFlag  = SIM_RSTAT_POR_MASK,  /*!< The Power on reset caused the most recent reset. */
    kSIM_ExternalResetFlag = SIM_RSTAT_EXTR_MASK, /*!< The external reset caused the most recent reset, that means
                                                        the external reset pin was asserted or remained asserted
                                                        after the power-on reset de-asserted. */
    kSIM_COPLossOfReferenceResetFlag = SIM_RSTAT_COP_LOR_MASK, /*!< The computer operating properly module signaled a
                                                                    PLL loss of reference clock reset caused the most
                                                                    recent reset. */
    kSIM_COPCPUTimeOutResetFlag = SIM_RSTAT_COP_CPU_MASK,      /*!< The computer operating properly module signaled a
                                                                   CPU time-out reset caused the most recent reset. */
    kSIM_SofwareResetFlag = SIM_RSTAT_SWR_MASK, /*!< The previous system reset occurred as a result of a software
                                                    reset */
    kSIM_COPWindowTimeOutResetFlag = SIM_RSTAT_COP_WIN_MASK, /*!< The previous system reset occurred as a result of a
                                                                 cop_window reset. */
};

/*!
 * @brief The enumeration of stop mode operation can be used to enable/disable stop mode enter.
 */
typedef enum _sim_stop_mode_operation
{
    kSIM_STOPInstrutionEnterStopMode = 0U, /*!< Stop mode is entered when the DSC core executes a STOP instruction. */
    kSIM_STOPInstrutionNotEnterStopMode,   /*!< The DSC core STOP instruction does not cause entry into stop mode. */
    kSIM_STOPInstrutionEnterStopModeWriteProtect,     /*!< Stop mode is entered when the DSC core executes a STOP
                                                           instruction, and the realted register bit field is write
                                                           protected until the next reset. */
    kSIM_STOPInstructionNotEnterStopModeWriteProtect, /*!< The DSC core STOP instruction does not cause entry into
                                                           stop mode, and the related register bit field is write
                                                           protected until the next reset. */
} sim_stop_mode_operation_t;

/*!
 * @brief The enumeration of wait mode operation can be used to enable/disable wait mode enter.
 */
typedef enum _sim_wait_mode_operation
{
    kSIM_WAITInstrutionEnterWaitMode = 0U, /*!< Wait mode is entered when the DSC core executes a WAIT instruction. */
    kSIM_WAITInstrutionNotEnterWaitMode,   /*!< The DSC core WAIT instruction does not cause entry into wait mode. */
    kSIM_WAITInstrutionEnterWaitModeWriteProtect,     /*!< Wait mode is entered when the DSC core executes a WAIT
                                                           instruction, and the realted register bit field is write
                                                           protected until the next reset. */
    kSIM_WAITInstructionNotEnterWaitModeWriteProtect, /*!< The DSC core WAIT instruction does not cause entry into
                                                           wait mode, and the related register bit field is write
                                                           protected until the next reset. */
} sim_wait_mode_operation_t;

/*! @brief The enumeration of OnCE clock operation mode, such as enabled when core TAP is enabled and always enabled */
typedef enum _sim_onceclk_operation_mode
{
    kSIM_OnCEClkEnabledWhenCoreTapEnabled = 0U, /*!< The OnCE clock to the DSC core is enabled when the core
                                                       TAP is enabled. */
    kSIM_OnCEClkAlwaysEnabled = 1U              /*!< The OnCE clock to the DSC core is always enabled. */
} sim_onceclk_operation_mode_t;

