nxp-appcodehub/an-mc_pfc_56f83783/HVP_pmsm_pfc_MC56F83783/drivers/fsl_sim.h
/*! @brief The enumeration of dma operation mode, this enumeration can be used to disable/enable DMA module in different
   power modes. */
typedef enum _sim_dma_operation_mode
{
    kSIM_DMADisable = 0U,                        /*!< DMA module is disabled. */
    kSIM_DMAEnableAtRunModeOnly,                 /*!< DMA module is enabled in run mode only. */
    kSIM_DMAEnableAtRunModeWaitMode,             /*!< DMA module is enabled in run and wait modes only. */
    kSIM_DMAEnableAtAllPowerModes,               /*!< DMA module is enabled in all power modes. */
    kSIM_DMADisableWriteProtect,                 /*!< DMA module is disabled and the related register bit field is write
                                                            protected until the next reset. */
    kSIM_DMAEnableAtRunModeOnlyWriteProtect,     /*!< DMA module is enabled in run mode only and the related bit field
                                                        is write protected until the next reset. */
    kSIM_DMAEnableAtRunModeWaitModeWriteProtect, /*!< DMA module is enabled in run and wait modes only and the
                                                        related register bit field is write protected until the next
                                                        reset. */
    kSIM_DMAEnableAtAllPowerModesWriteProtect,   /*!< DMA module is enabled in all low power modes and the related
                                                          register bit field is write protected until the next reset. */
} sim_dma_operation_mode_t;

/*!
 * @brief The enumeration of device's boot mode, including ROM boot and NVM flash boot.
 */
typedef enum _sim_boot_mode
{
    kSIM_BootFromNVMFlash = 0U, /*!< Indicates the chip is boot from NVM Flash. */
    kSIM_BootFromROM      = 1U, /*!< Indicates the chip is boot from ROM. */
} sim_boot_mode_t;

/*!
 * @brief The enumeration of small regualtor 1P2V control mode, such as normal mode and standby mode.
 */
typedef enum _sim_small_regulator_1P2V_control_mode
{
    kSIM_SmallRegulator1P2VInNormalMode = 0U,         /*!< Small regulator 1.2V supply placed in normal mode. */
    kSIM_SmallRegulator1P2VInStandbyMode,             /*!< Small regulator 1.2V supply placed in standby mode. */
    kSIM_SmallRegulator1P2VInNormalModeWriteProtect,  /*!< Small regulator 1.2V supply placed in nomal mode, and the
                                                        related register bit field is write protected until the next
                                                         reset. */
    kSIM_SmallRegulator1P2VInStandbyModeWriteProtect, /*!< Small regulator 1.2V supply placed in standby mode, and the
                                                        related register bit field is write protected until the next
                                                        reset. */
} sim_small_regulator_1P2V_control_mode_t;

/*!
 * @brief The enumeration of small regulator 2P7V control mode, such as normal mode, standby mode, powerdown mode, etc.
 */
typedef enum _sim_small_regulator_2P7V_control_mode
{
    kSIM_SmallRegulator2P7VInNormalMode             = 0U, /*!< Small regulator 2.7V supply placed in normal mode. */
    kSIM_SmallRegulator2P7VInStandbyMode            = 1U, /*!< Small regulator 2.7V supply placed in standby mode. */
    kSIM_SmallRegulator2P7VInPowerdownMode          = 4U, /*!< Small regulator 2.7V supply placed in powerdown mode. */
    kSIM_SmallRegulator2P7VInNormalModeWriteProtect = 2U, /*!< Small regulator 2.7V supply placed in normal mode and the
                                                            related bit field is write protected until chip reset. */
    kSIM_SmallRegulator2P7VInStandbyModeWriteProtect = 3U, /*!< Small regulator 2.7V supply placed in standby mode and
                                                                the related bit field is write protected until chip
                                                                reset. */
    kSIM_SmallRegulator2P7VInPowerdownModeWriteProtect = 0xCU, /*!< Small regulator placed in powerdown mode and the
                                                               related bit field is write protected until chip reset. */
} sim_small_regulator_2P7V_control_mode_t;

/*!
 * @brief The enumeration of large regulator contorl mode, such as normal mode, standby mode.
 */
typedef enum _sim_large_regulator_control_mode
{
    kSIM_LargeRegulatorInNormalMode = 0U,         /*!< Large regulator placed in normal mode. */
    kSIM_LargeRegulatorInStandbyMode,             /*!< Large regulator placed in standby mode. */
    kSIM_LargeRegulatorInNormalModeWriteProtect,  /*!< Large regulator placed in normal mode, and the related register
                                                       bit field is write protected until chip reset. */
    kSIM_LargeRegulatorInStandbyModeWriteProtect, /*!< Large regulator placed in standby mode, and the related register
                                                       bit field is write protected until chip reset. */
} sim_large_regulator_control_mode_t;

/*!
 * @brief The enumeration of modules that support various protection mode.
 */
typedef enum _sim_write_protection_module
{
    kSIM_GPIOInternalPeripheralSelectProtection = 0U, /*!< Used to control the protection mode GPSn and
                                                                    IPSn registers in the SIM, all XBAR, EVTG,
                                                                    GPIOn_PER, GPIOn_PPMODE, GPIOn_DRIVE. */
    kSIM_PeripheralClockEnableProtection = 2U,        /*!< Used to control the protection mode of PCEn, SDn,
                                                                          PSWRn, and PCR register. */
    kSIM_GPIOPortDProtection = 4U,                    /*!< Used to control the protection mode of GPIO_D_PER,
                                                                         GPIO_D_PPMODE, and GPIO_D_DRIVE register. */
    kSIM_PowerModeControlWriteProtection = 6U,        /*!< Used to control the protection mode of the PWRMODE
                                                                           register. */
} sim_write_protection_module_t;

/*! @brief The enumeration of write protection mode, such as write protection off, write protection on, etc. */
typedef enum _sim_write_protection_mode
{
    kSIM_WriteProtectionOff          = 0U, /*!< Write protection off. */
    kSIM_WriteProtectionOn           = 1U, /*!< Write protection on. */
    kSIM_WriteProtectionOffAndLocked = 2U, /*!< Write protection off and locked until chip reset. */
    kSIM_WriteProtectionOnAndLocked  = 3U  /*!< Write protection on and locked until chip reset. */
} sim_write_protection_mode_t;

/*!
 * @brief The enumeration of lpi2c trigger selection, including slave trigger and master trigger.
 */
typedef enum _sim_lpi2c_trigger_selection
{
    kSIM_Lpi2cSlaveTrigger = 0U, /*!< Selects slave trigger. */
    kSIM_Lpi2cMasterTrigger,     /*!< Selects master trigger. */
} sim_lpi2c_trigger_selection_t;

#if (defined(FSL_FEATURE_SIM_MISC0_HAS_MODE_STAT_BIT_FIELD) && FSL_FEATURE_SIM_MISC0_HAS_MODE_STAT_BIT_FIELD)
/*!
 * @brief The enumeration of device operate mode, including normal mode and fast mode.
 */
typedef enum _sim_device_operate_mode
{
    kSIM_NormalOperateMode = 0U, /*!< Device in normal operating mode, core:bus frequency as 1:1 */
    kSIM_FastOperateMode,        /*!< Device in fast operate mode, core:bus frequency as 2:1 */
} sim_device_operate_mode_t;
