nxp-appcodehub/an-mc_pfc_56f83783/HVP_pmsm_pfc_MC56F83783/drivers/fsl_sim.h
#endif /* FSL_FEATURE_SIM_MISC0_HAS_MODE_STAT_BIT_FIELD */

/*!
 * @brief The enumeration of master pit.
 */
typedef enum _sim_master_pit_selection
{
    kSIM_PIT0MasterPIT1Slave = 0U, /*!< PIT0 is master PIT and PIT1 is slave PIT. */
    kSIM_PIT1MasterPIT0Slave = 1U, /*!< PIT0 is master PIT and PIT1 is slave PIT. */
} sim_master_pit_selection_t;

/*******************************************************************************
 * API
 ******************************************************************************/

#if defined(__cplusplus)
extern "C" {
#endif

/*!
 * @name Low Power Mode Control Related Interfaces
 * @{
 */

/*!
 * @brief Sets the operation of wait mode, enable/disable the entry of wait mode.
 *
 * @param base SIM peripheral base address.
 * @param eOperation Used to enable/disable the wait mode, please refer to @ref sim_wait_mode_operation_t.
 */
static inline void SIM_SetWaitModeOperation(SIM_Type *base, sim_wait_mode_operation_t eOperation)
{
    base->CTRL = (base->CTRL & (~SIM_CTRL_WAIT_DISABLE_MASK)) | SIM_CTRL_WAIT_DISABLE(eOperation);
}

/*!
 * @brief Sets the operation of stop mode, enable/disable the entry of stop mode.
 *
 * @param base SIM peripheral base address.
 * @param eOperation Used to enable/disable the stop mode, please refer to @ref sim_stop_mode_operation_t.
 */
static inline void SIM_SetStopModeOperation(SIM_Type *base, sim_stop_mode_operation_t eOperation)
{
    base->CTRL = (base->CTRL & (~SIM_CTRL_STOP_DISABLE_MASK)) | SIM_CTRL_STOP_DISABLE(eOperation);
}

/*!
 * @brief Enters into LPMode when the advanced power mode is enabled(register FOPT[1] bit is set).
 *
 * @note Please make sure the power mode register is not set as write protected before invoking this function.
 * @note This function is useful only when the FTFE module's FOPT[0] bit is set(advanced power mode is enabled).
 *
 * @param base SIM peripheral base address.
 */
static inline void SIM_EnterLPMode(SIM_Type *base)
{
    base->PWRMODE |= SIM_PWRMODE_LPMODE_MASK;
}

/*!
 * @brief Exits from LPMode when the advanced power mode is enabled(register FOPT[1] bit is set).
 *
 * @note Please make sure the power mode register is not set as write protected before invoking this function.
 * @note This function is useful only when the FTFE module's FOPT[0] bit is set(advanced power mode is enabled).
 *
 * @param base SIM peripheral base address.
 */
static inline void SIM_ExitLPMode(SIM_Type *base)
{
    base->PWRMODE &= ~SIM_PWRMODE_LPMODE_MASK;
}

/*!
 * @brief Enters into VLPMode when the advanced power mode is enabled(register FOPT[1] bit is set).
 *
 * @note Please make sure the power mode register is not set as write protected before invoking this function.
 * If both set to enter LPMode and VLPMode, the VLPMode has higher priority.
 * @note This function is useful only when the FTFE module's FOPT[0] bit is set(advanced power mode is enabled).
 *
 * @param base SIM peripheral base address.
 */
static inline void SIM_EnterVLPMode(SIM_Type *base)
{
    base->PWRMODE |= SIM_PWRMODE_VLPMODE_MASK;
}

/*!
 * @brief Exits from VLPMode when the advanced power mode is enabled(register FOPT[1] bit is set).
 *
 * @note Please make sure the power mode register is not set as write protected before invoking this function.
 * @note This function is useful only when the FTFE module's FOPT[0] bit is set(advanced power mode is enabled).
 *
 * @param base SIM peripheral base address.
 */
static inline void SIM_ExitVLPMode(SIM_Type *base)
{
    base->PWRMODE &= ~SIM_PWRMODE_VLPMODE_MASK;
}

/*!
 * @brief Indicates whether the chip is in LPMode when the advanced power mode is enabled(register FOPT[1] bit is set).
 *
 * @note This function is useful only when the FTFE module's FOPT[0] bit is set(advanced power mode is enabled).
 *
 * @param base SIM peripheral base address.
 * @retval true  The chip is in LPMode.
 * @retval false The chip is not in LPMode.
 */
static inline bool SIM_IsInLPMode(SIM_Type *base)
{
    return ((base->PWRMODE & SIM_PWRMODE_LPMS_MASK) == SIM_PWRMODE_LPMS_MASK);
}

/*!
 * @brief Indicates whether the chip is in VLPMode when the advanced power mode is enabled(register FOPT[1] bit is set).
 *
 * @note This function is useful only when the FTFE module's FOPT[0] bit is set(advanced power mode is enabled).
 *
 * @param base SIM peripheral base address.
 * @retval true  The chip is in VLPMode.
 * @retval false The chip is not in VLPMode.
 */
static inline bool SIM_IsInVLPMode(SIM_Type *base)
{
    return ((base->PWRMODE & SIM_PWRMODE_VLPMS_MASK) == SIM_PWRMODE_VLPMS_MASK);
}

/*!
 * @}
 */

/*!
 * @name Reset Related Interfaces
 * @{
 */

/*!
 * @brief Triggers the software reset for device.
 *
 * @param base SIM base address.
 */
static inline void SIM_TriggerSoftWareReset(SIM_Type *base)
{
    base->CTRL |= SIM_CTRL_SWRST_MASK;
}

/*!
 * @brief Gets the cause of the most recent reset.
 *
 * @note At any given time, the only one reset source is indicated. When multiple reset source assert simultaneously,
 * the reset source with the highest precedence is indicated. The precedence from highest to lowest is POR, external
 * reset, COP loss of reference reset, COP CPU time-out reset, software reset, COP window time-out reset. The POR is
 * always set during a power-on reset. However, POR is cleared and the external reset is set if the external reset pin
 * is asserted or remains asserted after the power-on reset has de-asserted.
 *
 * @param base SIM peripheral base address.
 * @return The current reset status flags, should be the OR'ed value of @ref _sim_reset_status_flags.
 */
static inline uint16_t SIM_GetResetStatusFlags(SIM_Type *base)
{
    return (base->RSTAT & SIM_RESET_STATUS_MASK);
}

/*!
 * @brief Triggers the software reset of specific peripheral.
 *
 * @param base SIM peripheral base address.
 * @param ePeriIndex The index of the peripheral to be reset, please refer to @ref sim_swReset_peri_index_t.
 */
static inline void SIM_TriggerPeripheralSoftwareReset(SIM_Type *base, sim_swReset_peri_index_t ePeriIndex)
{
    if ((uint8_t)ePeriIndex < 16U)
    {
        base->PSWR0 |= ((1UL) << ((uint8_t)ePeriIndex));
        base->PSWR0 &= (~((1UL) << ((uint8_t)ePeriIndex)));
    }
    else if ((uint8_t)ePeriIndex < 32U)
    {
        base->PSWR1 |= ((1UL) << (((uint8_t)ePeriIndex) % 16U));
        base->PSWR1 &= (~((1UL) << ((uint8_t)ePeriIndex) % 16U));
    }
    else if ((uint8_t)ePeriIndex < 48U)
    {
        base->PSWR2 |= ((1UL) << (((uint8_t)ePeriIndex) % 16U));
        base->PSWR2 &= (~((1UL) << ((uint8_t)ePeriIndex) % 16U));
    }
    else if ((uint8_t)ePeriIndex < 64U)
    {
        base->PSWR3 |= ((1UL) << (((uint8_t)ePeriIndex) % 16U));
        base->PSWR3 &= (~((1UL) << ((uint8_t)ePeriIndex) % 16U));
    }
}

/*!
 * @brief Enables/Disables the input filter on external reset padcell.
 *
 * If the input filter is enabled, the filter will remove transient signals on the input at the expense of an increased
 * input delay.
 *
 * @note If the input filter is enabled, the filter will affect all input functions supported by that padcell, including
 * GPIO.
 *
 * @param base SIM peripheral base address.
 * @param bEnable Used to control the behaviour of input filter.
 *                  - \b true Enable the input filter on external input padcell.
 *                  - \b false Disable the input filter on external input padcell.
 */
static inline void SIM_EnableResetPadCellInputFilter(SIM_Type *base, bool eEnable)
{
    if (eEnable)
    {
        base->CTRL |= SIM_CTRL_RST_FILT_MASK;
    }
    else
    {
        base->CTRL &= ~SIM_CTRL_RST_FILT_MASK;
    }
}

/*!
 * @}
 */

/*!
 * @name Peripheral Signal Muxing Control Interfaces
 * @{
 */
/*!
 * @brief Sets internal peripheral inputs, some peripheral inputs have the ability to be connected to either XBAR
 * outputs or GPIO.
 *
 * @param base SIM base address.
 * @param eIndex The internal peripherals that supply multi-inputs, please refer to @ref sim_internal_peri_index_t.
 * @param eInput The specific input that connected to the selected internal peripheral, please refer
 *              to @ref sim_internal_peri_input_t.
 */
static inline void SIM_SetInternalPeriInput(SIM_Type *base,
                                            sim_internal_peri_index_t eIndex,
                                            sim_internal_peri_input_t eInput)
{
    base->IPS0 &= (~(1UL << eIndex));
    base->IPS0 |= (((uint16_t)eInput) << eIndex);
}

#if (defined(FSL_FEATURE_SIM_HAS_PWM_SEL_REGISTER) && FSL_FEATURE_SIM_HAS_PWM_SEL_REGISTER)
/*!
 * @brief Selects the Xbar input from PWMA and PWMB.
 *
 * @param base SIM base address.
 * @param eIndex SIM PWM select register field index, please refer to @ref sim_xbar_input_pwm_index_t.
 * @param eSelection Xbar input pwm selection, please refer to @ref sim_xbar_input_pwm_selection_t.
 */
static inline void SIM_SetXbarInputPWMSelection(SIM_Type *base,
                                                sim_xbar_input_pwm_index_t eIndex,
                                                sim_xbar_input_pwm_selection_t eSelection)
{
    base->PWM_SEL &= (~(1UL << eIndex));
    base->PWM_SEL |= (((uint16_t)eSelection) << eIndex);
}
#endif /* FSL_FEATURE_SIM_HAS_PWM_SEL_REGISTER */

/*!
 * @brief Selects the Xbar input from ADC and TMR A/B.
 *
 * @param base SIM base address.
 * @param index SIM ADC and TMR select register field index, please refer to @ref sim_xbar_input_adc_tmr_index_t.
 * @param mode Xbar input ADC and TMR selection, please refer to @ref sim_xbar_input_adc_tmr_selection_t.
 */
static inline void SIM_SetXbarInputAdcTmrSelection(SIM_Type *base,
                                                   sim_xbar_input_adc_tmr_index_t eIndex,
                                                   sim_xbar_input_adc_tmr_selection_t eSelection)
{
    base->ADC_TMR_SEL &= (~(1UL << eIndex));
    base->ADC_TMR_SEL |= (((uint16_t)eSelection) << eIndex);
}

/*! @} */

/*!
 * @name Voltage Regulators Control Interfaces
 * @{
 */

/*!
 * @brief Sets the control mode of small regulator 1.2V supply, the available control modes are normal mode, standby
 * mode, etc.
 *
 * @note This function is useful only when the flash module's FOPT[0] bit is 0.
 *
 * @param base SIM peripheral base address.
 * @param eControlMode The control mode to be set, please refer to @ref sim_small_regulator_1P2V_control_mode_t.
 */
static inline void SIM_SetSmallRegulator1P2VControlMode(SIM_Type *base,
                                                        sim_small_regulator_1P2V_control_mode_t eControlMode)
{
    base->PWR = (base->PWR & (~SIM_PWR_SR12STDBY_MASK)) | SIM_PWR_SR12STDBY(eControlMode);
}

/*!
 * @brief Sets the control mode of small regulator 2.7 supply, the available control modes are normal mode, standby
 * mode, etc.
 *
 * @note This function is useful only when the flash module's FOPT[0] bit is 0.
 *
 * @param base SIM peripheral base address.
 * @param eControlMode THe control mode to be set, please refer to @ref sim_small_regulator_2P7V_control_mode_t.
 */
static inline void SIM_SetSmallRegulator2P7VControlMode(SIM_Type *base,
                                                        sim_small_regulator_2P7V_control_mode_t eControlMode)
{
    base->PWR = (base->PWR & (~SIM_PWR_SR27_CONTROL_MODE_MASK)) | SIM_PWR_SR27_CONTROL_MODE(eControlMode);
}

/*!
 * @brief Sets the control mode of large regulator, the available control mode are normal mode, standby mode, etc.
 *
 * @note This function is useful only when the flash module's FOPT[0] bit is 0.
 *
 * @param base SIM peripheral base address.
 * @param eControlMode The control mode to be set, please refer to @ref sim_large_regulator_control_mode_t.
 */
static inline void SIM_SetLargeRegulatorControlMode(SIM_Type *base, sim_large_regulator_control_mode_t eControlMode)
{
    base->PWR = (base->PWR & (~SIM_PWR_LRSTDBY_MASK)) | SIM_PWR_LRSTDBY(eControlMode);
}

/*! @} */

/*!
 * @name Write Protection Interfaces
 * @{
 */

/*!
 * @brief Sets the write protection mode of the selected register.
 *
 * @param base SIM peripheral base address.
 * @param eModule The module to be set, please refer to @ref sim_write_protection_module_t.
 * @param eMode The specific write protection mode to be set, please refer to @ref sim_write_protection_mode_t.
 */
static inline void SIM_SetRegisterProtectionMode(SIM_Type *base,
                                                 sim_write_protection_module_t eModule,
                                                 sim_write_protection_mode_t eMode)
{
    base->PROT = base->PROT & (~SIM_PROT_BIT_FIELD_MASK(eModule)) | SIM_PORT_SET_MODE_PROTECTION_MODE(eModule, eMode);
}

/*! @} */

/*!
 * @name JTAG ID And Factory Trim Value Interfaces
 * @{
 */

/*!
 * @brief Gets JTAG ID, the JTAG ID is 32bits width.
 *
 * @param base SIM base address.
 * @return The 32bits width JTAG ID.
 */
static inline uint32_t SIM_GetJTAGID(SIM_Type *base)
{
    return ((((uint32_t)(base->MSHID)) << 16U) | ((uint32_t)base->LSHID));
}

#if (defined(FSL_FEATURE_SIM_HAS_NVMOPT6_LOW_REGISTER) && FSL_FEATURE_SIM_HAS_NVMOPT6_LOW_REGISTER)
/*!
 * @brief Gets the trim vlaue of the bandgap inside the PMC module, the available range is 0 to 15.
 *
 * @param base SIM peripheral base address.
 * @return The trim value of PMC's bandgap, ranges from 0 to 15.
 */
static inline uint8_t SIM_GetPMCBandgapTrim(SIM_Type *base)
{
    return (uint8_t)((base->NVMOPT6_LOW & SIM_NVMOPT6_LOW_PMC_BGTRIM_MASK) >> SIM_NVMOPT6_LOW_PMC_BGTRIM_SHIFT);
}

/*!
 * @brief Gets the trim value of 200KHz Relaxation Osillator Frequency, the available range is 0 to 511.
 *
 * @param base SIM peripheral base address.
 * @return The trim value of 200 khz Relaxation Oscillator frequency, ranges from 0 to 511.
 */
static inline uint16_t SIM_Get200KHzROSCFreqTrim(SIM_Type *base)
{
    return (uint16_t)(base->NVMOPT6_LOW & SIM_NVMOPT6_LOW_ROSC_200K_FTRIM_MASK);
}
#endif /* FSL_FEATURE_SIM_HAS_NVMOPT6_LOW_REGISTER */

/*! @} */

/*!
 * @name Short Addressing Control Related Interfaces
 * @{
 */

/*!
 * @brief Sets the I/O short address location value which specifies the memory referenced through the I/O short address
 * mode.
 *
 * The I/O short address mode allows the instrution to specify the lower 6 bits of the address. And the upper 18 bits of
 * the address can be controlled by invoking this function.
 *
 * @note The pipeline delay between setting the related register set and using short I/O addrssing with the new value is
 * five cycles.
 *
 * @param base SIM base address.
 * @param u32IOShortAddressValue The value of I/O short address location, this address value should be 24 bits width.
 */
static inline void SIM_SetIOShortBaseAddressValue(SIM_Type *base, uint32_t u32IOShortAddressValue)
{
    u32IOShortAddressValue >>= 6U;
    base->IOSAHI = (uint16_t)(u32IOShortAddressValue >> 16U) & 0x3U;
    base->IOSALO = (uint16_t)(u32IOShortAddressValue & 0xFFFFU);
}

/*! @} */

/*!
 * @name Software Control Interfaces
 * @{
 */

/*!
 * @brief Gets the software control data by the software control register index.
 *
 * @param base SIM base address.
 * @param eIndex SIM software control register index.
 * @return Software control registers value.
 */
static inline uint16_t SIM_GetSoftwareControlData(SIM_Type *base, sim_software_contrl_register_index_t eIndex)
{
    return (*((volatile uint16_t *)&(base->SCR0) + (uint16_t)eIndex));
}

/*!
 * @brief Sets the software control data by the software contorl register index, the data is for general-purpose use by
 * software.
 *
 * @param base SIM base address.
 * @param eIndex SIM software control register index.
 * @param u16Value Software control registers value.
 */
static inline void SIM_SetSoftwareControlData(SIM_Type *base,
                                              sim_software_contrl_register_index_t eIndex,
                                              uint16_t u16Value)
{
    (*((volatile uint16_t *)&(base->SCR0) + (uint16_t)eIndex)) = u16Value;
}

/*! @} */

/*!
 * @name Internal Peripheral Extend Control Interfaces
 * @{
 */

/*!
 * @brief Sets the operation mode of the OnCE clock, the available operation modes are always enabled and enabled when
 * the core TAP is enabled
 *
 * @param base SIM peripheral base address.
 * @param eOperationMode The operation mode of OnCE clock, please refer to @ref sim_onceclk_operation_mode_t.
 */
static inline void SIM_SetOnCEClockOperationMode(SIM_Type *base, sim_onceclk_operation_mode_t eOperationMode)
{
    if (eOperationMode == kSIM_OnCEClkAlwaysEnabled)
    {
        base->CTRL |= SIM_CTRL_ONCEEBL_MASK;
    }
    else
    {
        base->CTRL &= ~SIM_CTRL_ONCEEBL_MASK;
    }
}

/*!
 * @brief Sets the operation mode of DMA, such as disabled, enabled in run mode only, etc.
 *
 * @param base SIM peripheral base address.
 * @param eOperationMode The operation mode to be set, please refer to @ref sim_dma_operation_mode_t.
 */
static inline void SIM_SetDMAOperationMode(SIM_Type *base, sim_dma_operation_mode_t eOperationMode)
{
    base->CTRL = (base->CTRL & (~SIM_CTRL_DMAEBL_MASK)) | SIM_CTRL_DMAEBL(eOperationMode);
}

/*!
 * @brief Gets the device's boot mode, the available boot modes are ROM boot and NVM flash boot.
 *
 * @param base SIM peripheral base address.
 * @return The device's boot mode, please refer to @ref sim_boot_mode_t.
 */
static inline sim_boot_mode_t SIM_GetBootMode(SIM_Type *base)
{
    sim_boot_mode_t eBootMode;

    if ((base->RSTAT & SIM_RSTAT_BOOT_MODE_STATUS_MASK) == SIM_RSTAT_BOOT_MODE_STATUS_MASK)
    {
        eBootMode = kSIM_BootFromROM;
    }
    else
    {
        eBootMode = kSIM_BootFromNVMFlash;
    }

    return eBootMode;
}

